import { dataCard } from "../@types/appTypes";
import IMG1 from "../../img/command1.png";
import IMG2 from "../../img/command2.png";
import IMG3 from "../../img/command3.png";
import MinImg1 from "../../img/min1.png";
import MinImg2 from "../../img/min2.png";
import MinImg3 from "../../img/min3.png";

export const teamInfo: dataCard[] = [
  {
    img: IMG1,
    minImg: MinImg1,
    prof: "Врач",
    name: "Александр Дзидзария",
    description: `Врач уролог, онколог, андролог, доктор медицинских наук, президент ассоциации молодых урологов, наставник чемпионов по бодибилдингу и фитнесу.\nПозаботится о том, чтобы соблюдалась самая главная заповедь здоровья: не навреди.\nПопробуй тренировки с поддержкой эксперта по здоровью`,
    links: {
      instagram: "https://www.instagram.com/dzari.alex",
      telegram: "https://t.me/+ItGtIl4k1TIzYjJi",
      youtube: "https://www.youtube.com/@Dzari",
    },
  },
  {
    img: IMG2,
    minImg: MinImg2,
    prof: "Тренер",
    name: "Владислав Лапшин",
    description: `Профессиональный тренер, мастер спорта по бодибилдингу, фанат спорта во всех его проявлениях - от триатлона Ironman до бразильского джиу-джитсу.\nПрошел путь от тренера, до совладельца фитнес клуба Level fitness площадью 2000 м^2, с посещаемостью в 3 Тыс человек в месяц.\nМой опыт и знания помогли мне вырастить чемпиона мира по классическому бодибилдингу, который в разных уголках мира забрал все золото, представляя нашу страну.\nКак ассистент на кафедре РУДН Спортивной медицины и физкультурно-оздоровительных технологий, продолжаю вносить свой вклад в образование будущих тренеров.`,
    links: {
      instagram: "https://www.instagram.com/vladislav__lapshin",
    },
  },
  {
    img: IMG3,
    minImg: MinImg3,
    prof: "Врач",
    name: "Олег Ирышкин",
    description:
      "Врач эндокринолог, кандидат медицинских наук, эксперт по диетологии. Профессионально ответит на каверзные вопросы и объяснит, как применять науку о пище на практике, в жизни. Медицинский подход к фитнесу - это ФКН.",
    links: {
      instagram: "https://www.instagram.com/olegiryshkin_md",
    },
  },
  {
    img: IMG1,
    prof: "Врач",
    name: "Руслан Шипицын",
    description:
      "Врач травматолог-ортопед. Врач остеопат, мануальный терапевт. Врач ординатор психотерапевт. Основатель и преподаватель академии нейродвигательной реабилитации. Автор 5-ти систем мануального лечения. Мастер спорта России по пауэрлифтингу. IPF Чемпион мира по пауэрлифтингу (становая тяга). 2015 г. WRPF",
    links: {
      instagram: "https://instagram.com/dr.shipicyn",
    },
  },
  {
    img: IMG2,
    prof: "Тренер",
    name: "Юлия Галкина",
    description:
      "Профессиональный тренер по йоге и медитации, практикующий в Индии. Опыт преподавания в разных уголках мира: Филиппины, Вьетнам, Бали, Индия. Сертифицированный инструктор по хатха и аштанга йоге. Международная школа йоги “My yoga school”. Профессиональное физкультурное образование. Опыт преподавания более 10 лет.",
    links: {
      instagram: "https://instagram.com/yogalkina",
    },
  },
  {
    img: IMG3,
    prof: "Тренер",
    name: "Алексей Кузнецов",
    description: `Профессиональный бодибилдер IFBB Pro\nЛюбительская карьера:\nЧемпион Северо-Запада России\nЧемпион России\nЧемпион Европы\nВице-Чемпион Мира\nПрофессиональная карьера:\nМистер Европа – 2 место\nАрнольд Классик и Чемпионат Мира по профессионалам – 3 место\nСайбериан Пауэр Шоу Про – 2 место\nПрофессиональную карьеру продолжаю…😉`,
    links: {
      instagram: "https://instagram.com/aleksei_kuznetsov_elite_pro",
    },
  },
  {
    img: IMG1,
    prof: "Тренер",
    name: "Элеонора Романова",
    description: `Мастер спорта международного класса по художественной гимнастике.\nБронзовый призёр чемпионата мира и Европы.\nМногократный победитель и призёр международных соревнований по художественной гимнастике.`,
    links: {
      instagram: "https://instagram.com/romanova_98_",
    },
  },
  {
    img: IMG2,
    prof: "Тренер",
    name: "Ярослав Бражников",
    description: `Мастер спорта по акробатике. 2-х кратный чемпион России по спортивной акробатике, призер международных соревнований, член сборной России\nС 2015 года выступающий атлет в категории пляжный бодибилдинг Чемпион Москвы, Чемпион Южного Федерального Округа, вице чемпион России\nУчастник проекта Ninja Warrior на первом канале, принимал участие в съёмка кино, сериалах а так же тв шоу.`,
    links: {
      instagram: "https://instagram.com/yaroslav_brazhnikov",
    },
  },
];
